In [1]:
import numpy as np
import pandas as pd

In [ ]:
dfr = pd.DataFrame(np.random.rand(50).reshape(10,5))
print(dfr)

In [ ]:
# head(), tail()
dfr.head()

In [ ]:
dfr.tail()

In [ ]:
dfr.head(7)

# Selection

In [ ]:
#subsetting
df1 = pd.DataFrame(np.random.randint(0,9,16).reshape(4,4), 
                  index = ['a','b','c','d'],
                  columns = ['A','B','C','D'])
print(df1)

In [ ]:
print(df1.at['a','A']) # indexing

In [ ]:
print(df1.iat[1,1])

In [ ]:
print(df1.iloc[2,1])

In [ ]:
print(df1.iloc[[2],[1]])

In [ ]:
print(df1['B'])

In [ ]:
print(df1[['B','D']])

In [ ]:
print(df1[0])

In [ ]:
# slicing ":"
print(df1['a':'c'])

In [ ]:
print(df1[0:1])

In [ ]:
print(df1[0:2])

In [ ]:
#loc , iloc
#loc[row labels, col labels]
print(df1.loc['b':'d', "A":"C"])

In [ ]:
print(df1.loc['a':'c',:])

In [ ]:
print(df1.loc[['a','c'],['A','D']])

In [ ]:
df1.loc['a':'c',['A':"B",'D']]

In [ ]:
print(df1.loc['a':'c','A':'B'].join(df1.loc['a':'c','D']))

In [ ]:
#start:stop:step
print(df1.loc[:,['A','B','D']].loc['a':'c',:])

In [ ]:
#iloc
#iloc[row number, col number]
print(df1.iloc[1,3])

In [ ]:
print(df1.iloc[0:2,1:3])

In [ ]:
print(df1.iloc[[1],[0,2]])

In [ ]:
print(type(df1.iloc[[1],[0,2]]))

In [ ]:
print(df1.iloc[1,[0,2]])
print(type(df1.iloc[1,[0,2]]))

# Part - 2

In [2]:
#Filtering
# Boolean Condition
df = pd.DataFrame(np.random.rand(40).reshape(10,4),
                 columns = ['A','B','C','D'])

In [3]:
print(df)

          A         B         C         D
0  0.993619  0.959078  0.843648  0.705667
1  0.985669  0.167322  0.943185  0.594496
2  0.907469  0.997766  0.222065  0.979617
3  0.404149  0.019468  0.652715  0.905331
4  0.787717  0.890524  0.826057  0.021171
5  0.060042  0.821230  0.567292  0.847391
6  0.188973  0.683384  0.292534  0.987926
7  0.289773  0.450590  0.252160  0.901267
8  0.393856  0.259437  0.188892  0.523992
9  0.609022  0.882253  0.640777  0.189114

In [4]:
df['A'] > 0.5

0     True
1     True
2     True
3    False
4     True
5    False
6    False
7    False
8    False
9     True
Name: A, dtype: bool

In [5]:
df2 = df[df['A'] > 0.5]
print(df2)

          A         B         C         D
0  0.993619  0.959078  0.843648  0.705667
1  0.985669  0.167322  0.943185  0.594496
2  0.907469  0.997766  0.222065  0.979617
4  0.787717  0.890524  0.826057  0.021171
9  0.609022  0.882253  0.640777  0.189114

In [6]:
df3 = df.loc[df['A'] > 0.5]
print(df3)

          A         B         C         D
0  0.993619  0.959078  0.843648  0.705667
1  0.985669  0.167322  0.943185  0.594496
2  0.907469  0.997766  0.222065  0.979617
4  0.787717  0.890524  0.826057  0.021171
9  0.609022  0.882253  0.640777  0.189114

In [7]:
df.mean()>0.5

A    True
B    True
C    True
D    True
dtype: bool

In [8]:
df4 = df.loc[:,df.mean()>0.5]
print(df4)

          A         B         C         D
0  0.993619  0.959078  0.843648  0.705667
1  0.985669  0.167322  0.943185  0.594496
2  0.907469  0.997766  0.222065  0.979617
3  0.404149  0.019468  0.652715  0.905331
4  0.787717  0.890524  0.826057  0.021171
5  0.060042  0.821230  0.567292  0.847391
6  0.188973  0.683384  0.292534  0.987926
7  0.289773  0.450590  0.252160  0.901267
8  0.393856  0.259437  0.188892  0.523992
9  0.609022  0.882253  0.640777  0.189114

In [9]:
# &, |, ~

(df['A']<0.3) | (df['A']>0.7)

0     True
1     True
2     True
3    False
4     True
5     True
6     True
7     True
8    False
9    False
Name: A, dtype: bool

In [10]:
df5 = df[(df['A']<0.3) | (df['A']>0.7)]

In [11]:
print(df5)

          A         B         C         D
0  0.993619  0.959078  0.843648  0.705667
1  0.985669  0.167322  0.943185  0.594496
2  0.907469  0.997766  0.222065  0.979617
4  0.787717  0.890524  0.826057  0.021171
5  0.060042  0.821230  0.567292  0.847391
6  0.188973  0.683384  0.292534  0.987926
7  0.289773  0.450590  0.252160  0.901267

In [12]:
# any(), all()
df6 = df>0.1
print(df6)

       A      B     C      D
0   True   True  True   True
1   True   True  True   True
2   True   True  True   True
3   True  False  True   True
4   True   True  True  False
5  False   True  True   True
6   True   True  True   True
7   True   True  True   True
8   True   True  True   True
9   True   True  True   True

In [13]:
df6.all()

A    False
B    False
C     True
D    False
dtype: bool

In [14]:
df6.any()

A    True
B    True
C    True
D    True
dtype: bool

In [15]:
df6.any().any()

True

In [16]:
#isin()
df7 = pd.DataFrame(np.arange(9).reshape(3,3),
                  columns = ['A','B','C'])
print(df7)

   A  B  C
0  0  1  2
1  3  4  5
2  6  7  8

In [17]:
df8 = df7.isin([0,3])
print(df8)

       A      B      C
0   True  False  False
1   True  False  False
2  False  False  False

In [18]:
print(df7[df8])

     A   B   C
0  0.0 NaN NaN
1  3.0 NaN NaN
2  NaN NaN NaN

# Editing

In [19]:
#Adding
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 index = ['a','b','c'],
                 columns = ['A','B','C'])
print(df)

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [20]:
df['D'] = 17
print(df)

   A  B  C   D
a  1  2  3  17
b  4  5  6  17
c  7  8  9  17

In [21]:
df['E'] = [13,14,15]
df

   A  B  C   D   E
a  1  2  3  17  13
b  4  5  6  17  14
c  7  8  9  17  15

In [22]:
df['D'] = ['one','two','three']
df

   A  B  C      D   E
a  1  2  3    one  13
b  4  5  6    two  14
c  7  8  9  three  15

In [23]:
sr = pd.Series([10,11,12], index = ['a','b','c'])
df['D'] = sr
df

   A  B  C   D   E
a  1  2  3  10  13
b  4  5  6  11  14
c  7  8  9  12  15

In [24]:
del df['E']
df

   A  B  C   D
a  1  2  3  10
b  4  5  6  11
c  7  8  9  12

In [25]:
sr = df.pop('D')
df

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [26]:
print(type(sr))

<class 'pandas.core.series.Series'>

In [27]:
sr

a    10
b    11
c    12
Name: D, dtype: int64

In [28]:
df.insert(1,'Z',sr)
df

   A   Z  B  C
a  1  10  2  3
b  4  11  5  6
c  7  12  8  9

In [29]:
df.insert(3,'B2', df['B'])
df

   A   Z  B  B2  C
a  1  10  2   2  3
b  4  11  5   5  6
c  7  12  8   8  9

In [30]:
df2 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 index = ['a','b','c'],
                 columns = ['A','B','C'])
print(df2)

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [31]:
print(df2['A'])

a    1
b    4
c    7
Name: A, dtype: int64

In [32]:
print(df2.A)

a    1
b    4
c    7
Name: A, dtype: int64

In [33]:
t = df.loc['a']
print(type(t))

<class 'pandas.core.series.Series'>

In [34]:
df2

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [35]:
df2.loc['d'] = 12

In [36]:
df2

    A   B   C
a   1   2   3
b   4   5   6
c   7   8   9
d  12  12  12

In [37]:
df2.loc['d'] = [10,11,12]
df2

    A   B   C
a   1   2   3
b   4   5   6
c   7   8   9
d  10  11  12

In [38]:
sr=pd.Series([13,14,15],
            index = ['A','B','C'],
            name = 'e')
df2.loc['d'] = sr
df2

    A   B   C
a   1   2   3
b   4   5   6
c   7   8   9
d  13  14  15

In [39]:
df3 = df2.drop(['a'], axis = 0)
df3

    A   B   C
b   4   5   6
c   7   8   9
d  13  14  15

In [40]:
df4 = df3.drop(["A"], axis = 1)
df4

    B   C
b   5   6
c   8   9
d  14  15

In [41]:
df2

    A   B   C
a   1   2   3
b   4   5   6
c   7   8   9
d  13  14  15

In [42]:
df6 = df2.drop(['a','c'],axis = 0)
df6

    A   B   C
b   4   5   6
d  13  14  15